<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/pandas_chap06_0726.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

friends = [{'age': 15, 'job': 'student'},
           {'age':25, 'job':'developer'},
           {'age':30, 'job':'teacher'}]

df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age','job'])

In [3]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [4]:
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [5]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [6]:
df = df.drop(['John', 'Nate'])

In [7]:
df

       age        job
Jenny   25  developer

In [8]:
df = pd.DataFrame(friends,
                  index = ['John', 'Jenny', 'Nate'],
                  columns = ['age','job'])
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [9]:
df.drop(['John', 'Nate'], inplace = True)   # inplace를 적용하면 따로 assign 할 필요 없이 drop한 결과가 바로 df에 적용이 된다.
df

       age        job
Jenny   25  developer

In [10]:
friends = [{'name':'John', 'age': 15, 'job': 'student'},
           {'name':'Ben', 'age':25, 'job':'developer'},
           {'name':'Jenny', 'age':30, 'job':'teacher'}]

df = pd.DataFrame(friends,
                  columns = ['name', 'age','job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [11]:
df = df.drop(df.index[[0,2]])   # 인덱스의 번호로도 원하는 인덱스를 삭제할 수 있다.

In [12]:
df

  name  age        job
1  Ben   25  developer

In [13]:
df = pd.DataFrame(friends,
                  columns = ['name', 'age','job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [14]:
df = df[df.age>20]    # column의 값의 따라 drop을 할 수 있음
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [15]:
df = pd.DataFrame(friends,
                  columns = ['name', 'age','job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [16]:
df = df.drop('age', axis=1)   # column 중에서 age를 삭제해라
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [17]:
df = pd.DataFrame(friends,
                  columns = ['name', 'age','job'])
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [19]:
df.drop('age', axis=1, inplace = True)
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher